第一题：
使用SQL语句完成以下任务
统计一下不同借贷类型、交易类型、交易特征的发生频次，总交易额和平均交易额


数据集为:

In [177]:
accounts <- read.csv("data/accounts.csv",stringsAsFactors =F,fileEncoding="GBK")
card <- read.csv("data/card.csv",stringsAsFactors =F,fileEncoding="GBK")
clients <- read.csv("data/clients.csv",stringsAsFactors =F,fileEncoding="GBK")
disp <- read.csv("data/disp.csv",stringsAsFactors =F,fileEncoding="GBK")
district<- read.csv("data/district.csv",stringsAsFactors =F,fileEncoding="GBK")
loans <- read.csv("data/loans.csv",stringsAsFactors =F,fileEncoding="GBK")
order <- read.csv("data/order.csv",stringsAsFactors =F,fileEncoding="GBK")
trans <- read.csv("data/trans.csv",stringsAsFactors =F,fileEncoding="GBK")
library(sqldf)

In [5]:
head(accounts)
head(card)
head(clients)

  account_id district_id frequency date
1  576       55          月结      1993-01-01
2 3818       74          月结      1993-01-01
3  704       55          月结      1993-01-01
4 2378       16          月结      1993-01-01
5 2632       24          月结      1993-01-02
6 1972       77          月结      1993-01-02

  card_id disp_id issued     type
1 1005    9285    1993-11-07 普通卡
2  104     588    1994-01-19 普通卡
3  747    4915    1994-02-05 普通卡
4   70     439    1994-02-08 普通卡
5  577    3687    1994-02-15 普通卡
6  377    2429    1994-03-03 普通卡

  client_id sex birth_date district_id
1 1         女  1970-12-13 18
2 2         男  1945-02-04  1
3 3         女  1940-10-09  1
4 4         男  1956-12-01  5
5 5         女  1960-07-03  5
6 6         男  1919-09-22 12

In [6]:
head(disp)
head(district)
head(loans)

  disp_id client_id account_id type
1 1       1         1          所有者
2 2       2         2          所有者
3 3       3         2          用户
4 4       4         3          所有者
5 5       5         3          用户
6 6       6         4          所有者

  A1 GDP    A4      A10   A11   A12  A13  A14 A15  a16
1 1  283894 1204953 100.0 12541 0.29 0.43 167 35.6 41.1
2 2   11655   88884  46.7  8507 1.67 1.85 132 12.1 15.0
3 3   13146   75232  41.7  8980 1.95 2.21 111 18.8 18.7
4 4   16108  149893  67.4  9753 4.64 5.05 109 17.5 19.7
5 5   13452   95616  51.4  9307 3.85 4.43 118 13.7 15.9
6 6   12268   77963  51.5  8546 2.95 4.02 126 16.9 20.0

  loan_id account_id date       amount duration payments status
1 5314     1787      1993-07-05  96396 12       8033     B
2 5316     1801      1993-07-11 165960 36       4610     A
3 6863     9188      1993-07-28 127080 60       2118     A
4 5325     1843      1993-08-03 105804 36       2939     A
5 7240    11013      1993-09-06 274740 60       4579     A
6 6687     8261      1993-09-13  87840 24       3660     A

In [7]:
head(order)
head(trans)

  order_id account_id bank_to account_to amount k_symbol
1 29405     3         CD      24485939    327
2 29413     8         IJ      93210345   6712
3 29430    24         QR      46086388   7641
4 29433    25         AB      79838293   1110
5 29440    29         MN      93088209    829
6 29447    34         IJ      58999049   6070

  trans_id account_id date       type operation amount balance k_symbol bank
1  695247  2378       1993-01-01 贷   信贷资金  $700   $700
2  171812   576       1993-01-01 贷   信贷资金  $900   $900
3  207264   704       1993-01-01 贷   信贷资金  $1,000 $1,000
4 1117247  3818       1993-01-01 贷   信贷资金  $600   $600
5  579373  1972       1993-01-02 贷   信贷资金  $400   $400
6  771035  2632       1993-01-02 贷   信贷资金  $1,100 $1,100
  account
1 NA
2 NA
3 NA
4 NA
5 NA
6 NA

In [76]:
trans$amount <- as.numeric(substr(gsub(",","",trans$amount),2,nchar(trans$amount)))

In [125]:

cols<-c("type","operation","k_symbol")

for(col in cols){

    sql <- sprintf("select %s,count(%s) as freq,sum(amount) as sum_amount,avg(amount) as avg_amount 
    from trans group by %s",col,col,col)

    d<- sqldf(sql)

    print(d)
    
}

  type   freq sum_amount avg_amount
1   借 634571 2821775775   4446.746
2   贷 421749 3436086422   8147.231
         operation   freq sum_amount avg_amount
1                  183114   27479762   150.0691
2       从他行收款  65226  781479953 11981.1111
3       信用卡借方   8036   18170400  2261.1249
4         信贷资金 156743 2418522949 15429.8626
5 汇款到另一家银行 208283  672638484  3229.4450
6             现金 434918 2339570649  5379.3374
  k_symbol   freq sum_amount avg_amount
1          535314 5482193926 10241.0808
2   保险费  18500   24175193  1306.7672
3   养老金  30338  167472118  5520.2096
4 利息所得 184691   27517498   148.9921
5 房屋贷款 118065  498506416  4222.3048
6 支付贷款  13580   55253001  4068.7041
7     支票 155832    2744045    17.6090

第二题：
使用SQL语句完成以下任务
根据借贷类型、交易特征这两个变量，获取账户中贷款前2年各类的支出情况的均值和标准差，账户中前2年各类收入情况的均值和标准差。每种支出和收入的交易特征产生一个变量（使用R的转置），

最后计算总的出入账比率（各项支出的总和除以各项收入的总和）。

说明：借贷类型中（type），借代表账户出款的项目，贷代表账户入款的项目。

In [67]:
head(loans)

  loan_id account_id date       amount duration payments status t_date
1 5314     1787      1993-07-05  96396 12       8033     B      1993-07-05
2 5316     1801      1993-07-11 165960 36       4610     A      1993-07-11
3 6863     9188      1993-07-28 127080 60       2118     A      1993-07-28
4 5325     1843      1993-08-03 105804 36       2939     A      1993-08-03
5 7240    11013      1993-09-06 274740 60       4579     A      1993-09-06
6 6687     8261      1993-09-13  87840 24       3660     A      1993-09-13

In [93]:

loans_d<-sqldf("select account_id,min(date) as lo_date from loans group by account_id")

trans_d<-sqldf("select tr.account_id,tr.date as tr_date,lo.lo_date, tr.amount,tr.type,tr.k_symbol                
from trans as tr 
left join loans_d as lo on lo.account_id=tr.account_id
order by tr.account_id")

trans_d2<- trans_d[is.na(trans_d$lo_date)==F,]

head(trans_d2)

    account_id tr_date    lo_date    amount type k_symbol
240 2          1993-02-26 1994-01-05  1100  贷
241 2          1993-03-12 1994-01-05 20236  贷
242 2          1993-03-28 1994-01-05  3700  贷
243 2          1993-03-31 1994-01-05    14  贷   利息所得
244 2          1993-04-12 1994-01-05 20236  贷
245 2          1993-04-27 1994-01-05 11000  借

In [96]:
trans_d2$tr_date<-as.Date(trans_d2$tr_date)
trans_d2$lo_date<-as.Date(trans_d2$lo_date)

trans_d2[trans_d2$k_symbol=="",]$k_symbol="other"

head(trans_d2)

    account_id tr_date    lo_date    amount type k_symbol
240 2          1993-02-26 1994-01-05  1100  贷   other
241 2          1993-03-12 1994-01-05 20236  贷   other
242 2          1993-03-28 1994-01-05  3700  贷   other
243 2          1993-03-31 1994-01-05    14  贷   利息所得
244 2          1993-04-12 1994-01-05 20236  贷   other
245 2          1993-04-27 1994-01-05 11000  借   other

In [98]:
trans_d3<-trans_d2[trans_d2$tr_date>=trans_d2$lo_date-(365*2) 
              & trans_d2$tr_date<=trans_d2$lo_date,]
head(trans_d3)

    account_id tr_date    lo_date    amount type k_symbol
240 2          1993-02-26 1994-01-05  1100  贷   other
241 2          1993-03-12 1994-01-05 20236  贷   other
242 2          1993-03-28 1994-01-05  3700  贷   other
243 2          1993-03-31 1994-01-05    14  贷   利息所得
244 2          1993-04-12 1994-01-05 20236  贷   other
245 2          1993-04-27 1994-01-05 11000  借   other

In [103]:
trans_d4 <- sqldf("select type,k_symbol,avg(amount) as avg_amount,stdev(amount) as stdev_amount,sum(amount) as sum_amount  
  from trans_d3 group by type,k_symbol")

trans_d4

  type k_symbol avg_amount   stdev_amount sum_amount
1 借   other     9367.950113 10890.86538  191349749
2 借   保险费    1486.798913  2044.47223    1641426
3 借   利息所得     9.658537    15.06137        792
4 借   房屋贷款  5462.594608  3389.16577   21478922
5 借   支付贷款  3986.909091  2242.63034      87712
6 借   支票        20.571628    17.33245     118040
7 贷   other    20087.936878 14548.63546  282597096
8 贷   利息所得   167.298377    84.58797    1587327

In [119]:
library(reshape)
trans_d4_avg<- cast(trans_d4,type~k_symbol,value = "avg_amount")
ns_trans_d4_avg <- colnames(trans_d4_avg)

colnames(trans_d4_avg)[2:7]<- paste(ns_trans_d4_avg[2:7],"_avg")

trans_d4_stdev<- cast(trans_d4,type~k_symbol,value = "stdev_amount")

colnames(trans_d4_stdev)[2:7]<- paste(ns_trans_d4_avg[2:7],"_stdev")

trans_d4_as <- merge(trans_d4_avg,trans_d4_stdev)

trans_d4_as[is.na(trans_d4_as)]<-0

trans_d4_as

  type other _avg 保险费 _avg 利息所得 _avg 房屋贷款 _avg 支付贷款 _avg
1 借    9367.95   1486.799      9.658537    5462.595      3986.909
2 贷   20087.94      0.000    167.298377       0.000         0.000
  支票 _avg other _stdev 保险费 _stdev 利息所得 _stdev 房屋贷款 _stdev
1 20.57163  10890.87     2044.472      15.06137        3389.166
2  0.00000  14548.64        0.000      84.58797           0.000
  支付贷款 _stdev 支票 _stdev
1 2242.63         17.33245
2    0.00          0.00000

In [111]:

trans_d5<- cast(trans_d4,k_symbol~type,value = "sum_amount")

trans_d5[is.na(trans_d5)]<- 0

colnames(trans_d5)<-c('type','outcome','income')

trans_d5$out_in <- trans_d5$outcome/trans_d5$income

trans_d5

  type     outcome   income    out_in
1 other    191349749 282597096 0.677111519
2 保险费     1641426         0         Inf
3 利息所得       792   1587327 0.000498952
4 房屋贷款  21478922         0         Inf
5 支付贷款     87712         0         Inf
6 支票        118040         0         Inf

第三题：
检验以下指标是否和违约（bad_ind）相关
性别、贷款时年龄、居住地区的平均失业率、居住地区的平均犯罪率、人均GDP、贷款前3年的平均资产、账户余额的标准差、账户余额的中位数、账户余额的四分位差、账户余额的变异系数.
要求根据变量的度量类型，选取最合适的假设检验方法。

In [178]:
sql<- "select lo.account_id,lo.status ,lo.date as lo_date
,cl.client_id,cl.sex,cl.birth_date
,(dt.A12+dt.A13)/2 as unemployment_rate,(dt.A15+dt.A16)/2 as crime_rate,dt.GDP

from loans as lo
   left join disp as di on lo.account_id=di.account_id
   left join clients as cl on di.client_id= cl.client_id
   left join district as dt on cl.district_id=dt.A1
   left join trans as tr on tr.account_id=lo.account_id
"

df0 <- sqldf(sql)

head(df0)

  account_id status lo_date    client_id sex birth_date unemployment_rate
1 1787       B      1993-07-05 2166      女  1947-07-22 3.525
2 1787       B      1993-07-05 2166      女  1947-07-22 3.525
3 1787       B      1993-07-05 2166      女  1947-07-22 3.525
4 1787       B      1993-07-05 2166      女  1947-07-22 3.525
5 1787       B      1993-07-05 2166      女  1947-07-22 3.525
6 1787       B      1993-07-05 2166      女  1947-07-22 3.525
  crime_rate GDP
1 15.25      16979
2 15.25      16979
3 15.25      16979
4 15.25      16979
5 15.25      16979
6 15.25      16979

In [179]:
df1<-df0

df1$birth_date<-as.Date(df1$birth_date)
df1$lo_date<-as.Date(df1$lo_date)

df1$lo_age<-as.integer((df1$lo_date-df1$birth_date)/365)

head(df1)

  account_id status lo_date    client_id sex birth_date unemployment_rate
1 1787       B      1993-07-05 2166      女  1947-07-22 3.525
2 1787       B      1993-07-05 2166      女  1947-07-22 3.525
3 1787       B      1993-07-05 2166      女  1947-07-22 3.525
4 1787       B      1993-07-05 2166      女  1947-07-22 3.525
5 1787       B      1993-07-05 2166      女  1947-07-22 3.525
6 1787       B      1993-07-05 2166      女  1947-07-22 3.525
  crime_rate GDP   lo_age
1 15.25      16979 45
2 15.25      16979 45
3 15.25      16979 45
4 15.25      16979 45
5 15.25      16979 45
6 15.25      16979 45

In [180]:
loans_v<-sqldf("select account_id,min(date) as lo_date from loans group by account_id")

trans_v<-sqldf("select tr.account_id,tr.date as tr_date,lo.lo_date, balance                
from trans as tr 
left join loans_v as lo on lo.account_id=tr.account_id
order by tr.account_id")

trans_v$balance <- as.numeric(substr(gsub(",","",trans_v$balance),2,nchar(trans_v$balance)))

trans_v2<- trans_v[is.na(trans_v$lo_date)==F,]

trans_v2$tr_date<-as.Date(trans_v2$tr_date)
trans_v2$lo_date<-as.Date(trans_v2$lo_date)

In [181]:
trans_v3<-trans_v2[trans_v2$tr_date>=trans_v2$lo_date-(365*3) 
              & trans_v2$tr_date<=trans_v2$lo_date,]
head(trans_v3)

    account_id tr_date    lo_date    balance
240 2          1993-02-26 1994-01-05  1100
241 2          1993-03-12 1994-01-05 21336
242 2          1993-03-28 1994-01-05 25036
243 2          1993-03-31 1994-01-05 25050
244 2          1993-04-12 1994-01-05 45286
245 2          1993-04-27 1994-01-05 34286

In [186]:
library("data.table")

trans_v4<-data.table(trans_v3)

trans_v4<- trans_v4[,list(mean=mean(balance),median=median(balance),sd=sd(balance),quan=quantile(balance,0.75)-quantile(balance,0.25))
                    ,by=account_id]

head(trans_v4)

  account_id mean     median sd       quan
1  2         32372.29 30817  12058.94 14033.5
2 19         25197.14 20463  15039.32 19477.0
3 25         57345.75 59854  22174.80 33906.0
4 37         37367.83 37873  21786.01 38420.0
5 38         31383.58 29436  10950.72 13576.5
6 67         49323.34 48931  20496.66 28244.0

In [192]:
df2<- merge(df1,trans_v4)
df2$bad_ind<-ifelse(df2$status=="B" | df2$status=="D",1,
                       ifelse(df2$status=="A",0,NA))
head(df2)

  account_id status lo_date    client_id sex birth_date unemployment_rate
1 2          A      1994-01-05 2         男  1945-02-04 0.36
2 2          A      1994-01-05 2         男  1945-02-04 0.36
3 2          A      1994-01-05 2         男  1945-02-04 0.36
4 2          A      1994-01-05 2         男  1945-02-04 0.36
5 2          A      1994-01-05 2         男  1945-02-04 0.36
6 2          A      1994-01-05 2         男  1945-02-04 0.36
  crime_rate GDP    lo_age mean     median sd       quan    bad_ind
1 38.35      283894 48     32372.29 30817  12058.94 14033.5 0
2 38.35      283894 48     32372.29 30817  12058.94 14033.5 0
3 38.35      283894 48     32372.29 30817  12058.94 14033.5 0
4 38.35      283894 48     32372.29 30817  12058.94 14033.5 0
5 38.35      283894 48     32372.29 30817  12058.94 14033.5 0
6 38.35      283894 48     32372.29 30817  12058.94 14033.5 0

In [188]:
#贷款时年龄、居住地区的平均失业率、居住地区的平均犯罪率、人均GDP、贷款前3年的平均资产、账户余额的标准差、账户余额的中位数、账户余额的四分位差、账户余额的变异系数
continue_vars<- c("lo_age","unemployment_rate","crime_rate","GDP","mean","median","sd","quan")
#以上所有列为连续变量，而bad_ind属于两类属性变量,因此可以使用二分比较

In [225]:
for (continue_var in continue_vars){ 
    
    print(sprintf("两样本T检测: %s 和 bad_ind",continue_var))
    #tapply(df2[,continue_var],df2$bad_ind,summary)
    vt<-var.test(df2[,continue_var]~df2$bad_ind)
    print(vt)
    vt_p_value<-vt$p.value
    var_equal<- (vt_p_value>0.1)
    
    eff<-ifelse(var_equal,"不显著","显著")
    print(sprintf("两样本方差 %s,设置var.equal=%s",eff,var_equal))
    tt<-t.test(df2[,continue_var]~df2$bad_ind,var.equal=var_equal)
    print(tt)
    tt_p_value<-tt$p.value
    eff<-ifelse(tt_p_value<0.01,"显著","不显著")
    re<-sprintf("%s 和 bad_ind的相关性 %s",continue_var,eff)
    print(re)
}

[1] "两样本T检测: unemployment_rate 和 bad_ind"

	F test to compare two variances

data:  df2[, continue_var] by df2$bad_ind
F = 1.1287, num df = 99721, denom df = 22134, p-value < 2.2e-16
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 1.105604 1.152096
sample estimates:
ratio of variances
          1.128688

[1] "两样本方差 显著,设置var.equal=FALSE"

	Welch Two Sample t-test

data:  df2[, continue_var] by df2$bad_ind
t = -14.195, df = 34138, p-value < 2.2e-16
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -0.2315748 -0.1753815
sample estimates:
mean in group 0 mean in group 1
       3.111566        3.315044

[1] "unemployment_rate 和 bad_ind的相关性 显著"
[1] "两样本T检测: crime_rate 和 bad_ind"

	F test to compare two variances

data:  df2[, continue_var] by df2$bad_ind
F = 1.1406, num df = 99721, denom df = 22134, p-value < 2.2e-16
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 1.117251 1.164233
sample estimates:
ratio of variances
          1.140578

[1] "两样本方差 显著,设置var.equal=FALSE"

	Welch Two Sample t-test

data:  df2[, continue_var] by df2$bad_ind
t = -1.3669, df = 34272, p-value = 0.1717
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -0.22445857  0.04001576
sample estimates:
mean in group 0 mean in group 1
       18.32789        18.42011

[1] "crime_rate 和 bad_ind的相关性 不显著"
[1] "两样本T检测: GDP 和 bad_ind"

	F test to compare two variances

data:  df2[, continue_var] by df2$bad_ind
F = 1.2222, num df = 100330, denom df = 22759, p-value < 2.2e-16
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 1.197509 1.247256
sample estimates:
ratio of variances
           1.22221

[1] "两样本方差 显著,设置var.equal=FALSE"

	Welch Two Sample t-test

data:  df2[, continue_var] by df2$bad_ind
t = 8.5504, df = 36493, p-value < 2.2e-16
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 4194.396 6689.289
sample estimates:
mean in group 0 mean in group 1
       57558.47        52116.63

[1] "GDP 和 bad_ind的相关性 显著"
[1] "两样本T检测: lo_age 和 bad_ind"

	F test to compare two variances

data:  df2[, continue_var] by df2$bad_ind
F = 0.98604, num df = 100330, denom df = 22759, p-value = 0.1743
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 0.9661079 1.0062421
sample estimates:
ratio of variances
          0.986036

[1] "两样本方差 不显著,设置var.equal=TRUE"

	Two Sample t-test

data:  df2[, continue_var] by df2$bad_ind
t = -4.1979, df = 123090, p-value = 2.696e-05
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -0.6002598 -0.2181455
sample estimates:
mean in group 0 mean in group 1
       36.05833        36.46753

[1] "lo_age 和 bad_ind的相关性 显著"
[1] "两样本T检测: mean 和 bad_ind"

	F test to compare two variances

data:  df2[, continue_var] by df2$bad_ind
F = 0.87294, num df = 100330, denom df = 22759, p-value < 2.2e-16
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 0.8552963 0.8908271
sample estimates:
ratio of variances
         0.8729387

[1] "两样本方差 显著,设置var.equal=FALSE"

	Welch Two Sample t-test

data:  df2[, continue_var] by df2$bad_ind
t = 81.72, df = 32377, p-value < 2.2e-16
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 6495.671 6814.923
sample estimates:
mean in group 0 mean in group 1
       41954.42        35299.13

[1] "mean 和 bad_ind的相关性 显著"
[1] "两样本T检测: median 和 bad_ind"

	F test to compare two variances

data:  df2[, continue_var] by df2$bad_ind
F = 0.96615, num df = 100330, denom df = 22759, p-value = 0.0008674
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 0.9466270 0.9859519
sample estimates:
ratio of variances
         0.9661533

[1] "两样本方差 显著,设置var.equal=FALSE"

	Welch Two Sample t-test

data:  df2[, continue_var] by df2$bad_ind
t = 91.477, df = 33464, p-value < 2.2e-16
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 7636.21 7970.61
sample estimates:
mean in group 0 mean in group 1
       41354.14        33550.73

[1] "median 和 bad_ind的相关性 显著"
[1] "两样本T检测: sd 和 bad_ind"

	F test to compare two variances

data:  df2[, continue_var] by df2$bad_ind
F = 0.78482, num df = 100330, denom df = 22759, p-value < 2.2e-16
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 0.7689574 0.8009015
sample estimates:
ratio of variances
         0.7848189

[1] "两样本方差 显著,设置var.equal=FALSE"

	Welch Two Sample t-test

data:  df2[, continue_var] by df2$bad_ind
t = -50.084, df = 31359, p-value < 2.2e-16
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -2632.651 -2434.353
sample estimates:
mean in group 0 mean in group 1
       17175.76        19709.27

[1] "sd 和 bad_ind的相关性 显著"
[1] "两样本T检测: quan 和 bad_ind"

	F test to compare two variances

data:  df2[, continue_var] by df2$bad_ind
F = 0.74934, num df = 100330, denom df = 22759, p-value < 2.2e-16
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 0.7341991 0.7646993
sample estimates:
ratio of variances
         0.7493436

[1] "两样本方差 显著,设置var.equal=FALSE"

	Welch Two Sample t-test

data:  df2[, continue_var] by df2$bad_ind
t = -33.389, df = 30951, p-value < 2.2e-16
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
 -3204.559 -2849.184
sample estimates:
mean in group 0 mean in group 1
       23164.46        26191.33

[1] "quan 和 bad_ind的相关性 显著"

In [196]:
# sex 性别为分类变量，应使用卡方分析
table(df2$sex)
m<-matrix(table(df2$sex))
prop.table(m, 2)

#barplot(table(accepts$bankruptcy_ind))
table(df2$sex,df2$bad_ind)


library(prettyR)
xtab(~ sex + bad_ind, data=df2)

chisq.test(x=df2$sex,y=df2$bad_ind)
xtab(~ sex + bad_ind, data=df2, chisq = TRUE)

    女     男
116379 117248

     [,1]
[1,] 0.4981402
[2,] 0.5018598

         0     1
  女 49964 12569
  男 50365 10191

Crosstabulation of sex by bad_ind
	bad_ind
sex      0      1
女  49964  12569  62533
    79.9   20.1      -
   49.80  55.22  50.80

男  50365  10191  60556
   83.17  16.83      -
   50.20  44.78  49.20

  100329  22760 123089
   81.51  18.49 100.00
odds ratio = 0.8
relative risk (sex-男) = 0.84

	Pearson's Chi-squared test with Yates' continuity correction

data:  df2$sex and df2$bad_ind
X-squared = 218.15, df = 1, p-value < 2.2e-16

Crosstabulation of sex by bad_ind
	bad_ind
sex      0      1
女  49964  12569  62533
    79.9   20.1      -
   49.80  55.22  50.80

男  50365  10191  60556
   83.17  16.83      -
   50.20  44.78  49.20

  100329  22760 123089
   81.51  18.49 100.00
X2[1]=218.146, p=2.295594e-49

odds ratio = 0.8
relative risk (sex-男) = 0.84